### 작업형1번

In [ ]:
#주어진 데이터셋의 컬럼1에서 상위 10개의 데이터에 대하여 10개중 최솟값으로 대체한 후,
#걸럼2에서 값이 80이상인 데이터들 중 컬럼1의 평균값을 구하시오

In [129]:
import pandas as pd
data = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/train.csv")
data.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

In [131]:
data.loc[0]

age                64
sex            female
bmi             39.33
children            0
smoker             no
region      northeast
charges       14901.5
Name: 0, dtype: object

In [94]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1070 entries, 0 to 1069
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1070 non-null   int64
 1   sex       1070 non-null   object
 2   bmi       1070 non-null   float64
 3   children  1070 non-null   int64
 4   smoker    1070 non-null   object
 5   region    1070 non-null   object
 6   charges   1070 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 58.6+ KB

In [96]:
df = data.sort_values(by='bmi', ascending=False)
df.reset_index(drop=True, inplace=True)
df.head()

   age   sex    bmi  children smoker     region     charges
0   18  male  53.13         0     no  southeast   1163.4627
1   22  male  52.58         1    yes  southeast  44501.3982
2   23  male  50.38         1     no  southeast   2438.0552
3   58  male  49.06         0     no  southeast  11381.3254
4   52  male  47.74         1     no  southeast   9748.9106

In [97]:
# 10개 중 최솟값 구하기
df['bmi'].iloc[:10].min()

46.7

In [98]:
# 10개 중 최솟값으로 대체하기
df['bmi'].iloc[:10] = 15.96

C:\Users\PC\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [99]:
df['bmi']

0       15.960
1       15.960
2       15.960
3       15.960
4       15.960
         ...
1065    17.290
1066    17.195
1067    16.815
1068    16.815
1069    15.960
Name: bmi, Length: 1070, dtype: float64

In [100]:
df[df['age'] >= 50]['bmi'].mean()

31.293460317460283

### 작업형2번

In [13]:
# 주어진 데이터셋 중 앞에서부터 80% 데이터를 샘플링하여 특정 컬럼의 표준편차를 구하고, 
# 해당 컬럼에서 결측치를 중앙값으로 대체한 후 표준편차를 구하여 그 두 가지의 표준편차의 차이를 구하시오

#### 앞에서부터 80% 데이터 어떻게 구하즤?

In [101]:
data.shape[0]

1070

In [103]:
int(data.shape[0]*0.8)

856

In [14]:
# 앞에서부터 80% 데이터 구하는 방법을 몰라서 이렇게 숫자로 구함
1069 * 0.8

855.2

In [22]:
data2 = data.iloc[:855]
data2.shape

(855, 7)

In [23]:
data2.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

In [ ]:
# 특정 칼럼이라고 했으니까 임의로 'charges' 칼럼의 표준편차를 구해보자

In [26]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 855 entries, 0 to 854
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       855 non-null    int64
 1   sex       855 non-null    object
 2   bmi       855 non-null    float64
 3   children  855 non-null    int64
 4   smoker    855 non-null    object
 5   region    855 non-null    object
 6   charges   855 non-null    float64
dtypes: float64(2), int64(2), object(3)
memory usage: 46.9+ KB

In [27]:
data2['charges'].std()

12298.524442107428

In [28]:
std=data2['charges'].std()

In [29]:
#결측치가 없긴 하지만 일단 있다고 생각하고 대체하는 코드 작성
data2['charges']=data2['charges'].fillna(data2['charges'].median())

<ipython-input-29-210cfeb93509>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2['charges']=data2['charges'].fillna(data2['charges'].median())

In [30]:
# 결측치를 대체했다고 생각하고 다시 표준편차를 구한다
data2['charges'].std()

12298.524442107428

In [32]:
std2=data2['charges'].std()

In [33]:
# 그 두 가지 표준편차의 차이를 구한다
print(std-std2)

0.0

### 작업형3번

In [34]:
# 주어진 데이터셋에서 특정 칼럼의 이상치를 IQR rule에 의해 탐지하고 이상치들의 합을 구하시오

In [35]:
# 여기서는 bmi 칼럼으로 해보자

In [57]:
#1사분위 수
a= data['bmi'].quantile(0.25)

In [58]:
a

26.41

In [59]:
#3사분위수
b= data['bmi'].quantile(0.75)

In [60]:
b

34.77

In [61]:
#IQR 구하기
IQR = b-a
IQR

8.360000000000003

In [62]:
c=IQR*1.5

In [63]:
c

12.540000000000004

In [80]:
#1사분위 수  -  IQR*1.5
a=a-c
a

13.869999999999996

In [81]:
#3사분위 수 + IQR*1.5
b=b+c

In [82]:
b

47.31000000000001

In [90]:
#이상치들을 구한다
answer = data[(data['bmi'] < a) | (data['bmi'] > b)]
answer.reset_index(drop=True, inplace=True)
answer.head()

   age     sex    bmi  children smoker     region      charges
0   54  female  47.41         0    yes  southeast  63770.42801
1   47    male  47.52         1     no  southeast   8083.91980
2   37  female  47.60         2    yes  southwest  46113.51100
3   52    male  47.74         1     no  southeast   9748.91060
4   22    male  52.58         1    yes  southeast  44501.39820

In [91]:
answer.shape

(8, 7)

In [92]:
answer['bmi'].sum()

395.42

In [104]:
# 상위 70% 추출 + 사분위수 Q1의 값을 구하시오

In [105]:
import pandas as pd

In [153]:
#우선 임의의 데이터로 해보기
df = pd.read_csv('X_test.csv',encoding='euc-kr')
df.head()

,cust_id,총구매액,최대구매액,환불금액,주구매상품,주구매지점,내점일수,내점당구매건수,주말방문비율,구매주기
0,3500,70900400,22000000,4050000.0,골프,부산본점,13,1.461538,0.789474,26
1,3501,310533100,38558000,48034700.0,농산물,잠실점,90,2.433333,0.369863,3
2,3502,305264140,14825000,30521000.0,가공식품,본 점,101,14.623762,0.083277,3
3,3503,7594080,5225000,NaN,주방용품,부산본점,5,2.000000,0.000000,47
4,3504,1795790,1411200,NaN,수산품,청량리점,3,2.666667,0.125000,8

In [154]:
df2=df.sort_values(by='총구매액', ascending=False)
df2.reset_index(drop=True, inplace=True)
df2.head()

,cust_id,총구매액,최대구매액,환불금액,주구매상품,주구매지점,내점일수,내점당구매건수,주말방문비율,구매주기
0,3765,2861237540,100152000,137212100.0,시티웨어,광주점,141,2.517730,0.307042,2
1,4795,1930998930,81600000,164186720.0,기타,분당점,83,8.783133,0.279835,4
2,4294,1880331840,286000000,871514400.0,농산물,본 점,132,3.772727,0.238956,2
3,4763,1803688190,131836000,22195000.0,시티웨어,광주점,133,2.045113,0.345588,2
4,5403,1360483130,106680000,58425000.0,디자이너,광주점,88,1.875000,0.345455,4

In [158]:
int(df2.shape[0]*0.7)

1737

In [159]:
df22=df2[:int(df2.shape[0]*0.7)]

In [160]:
len(df22)

1737

In [162]:
df2.loc[df2['주구매지점']=='광주점']['내점일수'].quantile(0.3)

4.0

In [171]:
test=df2[df2['주구매지점']=='광주점']['내점일수']

In [173]:
test.head()

0     141
3     133
4      88
25     54
32    141
Name: 내점일수, dtype: int64

In [178]:
test.sort_values(ascending=False).index[:10]

Int64Index([149, 0, 32, 308, 3, 4, 235, 130, 62, 85], dtype='int64')

In [ ]:
df22=df2[:int]

In [116]:
df3 = df2.iloc[:1737]

In [117]:
len(df3)

1737

In [122]:
answer=df3['총구매액'].quantile(0.25)

In [123]:
print(answer)

26540000.0

In [125]:
df3['총구매액'].describe()['25%']

26540000.0

In [126]:
df3['총구매액'].describe()

count    1.737000e+03
mean     1.432899e+08
std      1.921497e+08
min      7.825000e+06
25%      2.654000e+07
50%      7.699621e+07
75%      1.898108e+08
max      2.861238e+09
Name: 총구매액, dtype: float64

In [ ]:
# 2022년 데이터 중 2022년 중앙값보다 큰 값의 데이터 수

In [205]:
import pandas as pd
data = pd.read_csv('t1-data2.csv')
data.set_index('year', inplace=True)
data.head()

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
year,,,,,,,,,,,,,,,,,,,,,
2022년,69,37,57,70,40,75,8,67,89,91,...,79,56,98,21,14,25,17,10,60,17
2023년,52,13,22,70,92,80,8,56,17,96,...,62,47,59,6,25,96,69,87,28,64
2024년,88,44,32,55,64,8,4,2,62,44,...,98,95,40,59,69,71,86,53,93,64
2025년,80,97,15,4,74,12,100,60,47,47,...,30,11,2,54,9,52,51,81,78,22
2026년,64,66,62,56,67,80,90,24,58,78,...,93,15,88,67,7,82,5,61,15,63

In [221]:
answer = data.loc["2022년"].median()

In [222]:
answer

54.5

In [224]:
sum(data.loc["2022년"] > answer)

50

In [ ]:
# 결측치 데이터(행)을 제거하고, 앞에서부터 60% 데이터만 활용해, 'f1' 칼럼 3사분위 값을 구하시오

In [127]:
import pandas as pd

In [164]:
data = pd.read_csv('t1-data1.csv')
data.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [151]:
data.shape[0]

90

In [152]:
data.isnull().sum()

id       0
age      0
city     0
f1      29
f2       0
f4       0
f5       0
dtype: int64

In [153]:
data.dropna(axis=0,inplace=True)
data.reset_index(drop=True, inplace=True)

In [154]:
data.isnull().sum()

id      0
age     0
city    0
f1      0
f2      0
f4      0
f5      0
dtype: int64

In [155]:
data.shape[0]

61

In [159]:
data2=data.iloc[:int(data.shape[0]*0.6)]

In [161]:
answer=data2['f1'].quantile(0.75)

In [162]:
print(answer)

77.25

In [ ]:
#결측치가 제일 큰 값의 컬럼명을 구하시오

In [147]:
data = pd.read_csv('t1-data1.csv')
data.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

#### method1

In [227]:
tf=data.isnull().sum()

In [151]:
data.isnull().sum().sort_values(ascending=False).index[0]

'f1'

In [228]:
print(tf.index[3])

f1

#### method2

In [230]:
tf = pd.DataFrame(data.isnull().sum(), columns=['cnt_null'])
tf = tf['cnt_null'].sort_values(ascending=False)

In [231]:
tf.head()

f1      29
f5       0
f4       0
f2       0
city     0
Name: cnt_null, dtype: int64

In [232]:
tf.index[0]

'f1'

#### 분류 - 여행 보험 패키지 상품을 구매할 확률 값을 구하시오

In [114]:
import pandas as pd

In [115]:
x_train = pd.read_csv('t2-1-train.csv')
x_test = pd.read_csv('t2-1-test.csv')

In [116]:
x_train.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,10000,28,Private Sector/Self Employed,Yes,1250000.0,6,1,No,No,0
1,10001,31,Private Sector/Self Employed,Yes,1250000.0,7,1,No,No,0
2,10002,29,Private Sector/Self Employed,Yes,1200000.0,7,0,No,No,1
3,10003,33,Government Sector,Yes,650000.0,6,1,No,No,1
4,10004,28,Private Sector/Self Employed,Yes,800000.0,6,0,No,Yes,1

In [117]:
#정답 데이터 만들어 주기
y_train = x_train[['id','TravelInsurance']]
y_train.set_index('id', inplace=True)
y_train.head()

       TravelInsurance
id
10000                0
10001                0
10002                1
10003                1
10004                1

In [118]:
#x_train.set_index('id', inplace=True)
x_train.drop(columns={'TravelInsurance'}, inplace=True)
x_train.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,10000,28,Private Sector/Self Employed,Yes,1250000.0,6,1,No,No
1,10001,31,Private Sector/Self Employed,Yes,1250000.0,7,1,No,No
2,10002,29,Private Sector/Self Employed,Yes,1200000.0,7,0,No,No
3,10003,33,Government Sector,Yes,650000.0,6,1,No,No
4,10004,28,Private Sector/Self Employed,Yes,800000.0,6,0,No,Yes

In [119]:
x_test.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,0,32,Government Sector,Yes,650000.0,5,0,No,No
1,1,27,Government Sector,Yes,500000.0,5,0,No,No
2,2,32,Government Sector,Yes,350000.0,2,0,No,No
3,3,26,Private Sector/Self Employed,Yes,1400000.0,6,0,No,Yes
4,4,27,Private Sector/Self Employed,No,350000.0,3,0,No,No

In [120]:
x_test.set_index('id',inplace=True)
x_test.head()

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
id,,,,,,,,
0,32,Government Sector,Yes,650000.0,5,0,No,No
1,27,Government Sector,Yes,500000.0,5,0,No,No
2,32,Government Sector,Yes,350000.0,2,0,No,No
3,26,Private Sector/Self Employed,Yes,1400000.0,6,0,No,Yes
4,27,Private Sector/Self Employed,No,350000.0,3,0,No,No

In [121]:
#이제 원핫인코딩이 필요한 칼럼을 확인해봅시다

#### 둘 다 Annual Income에 결측치가 있음

In [122]:
x_train.isnull().sum()

id                     0
Age                    0
Employment Type        0
GraduateOrNot          0
AnnualIncome           4
FamilyMembers          0
ChronicDiseases        0
FrequentFlyer          0
EverTravelledAbroad    0
dtype: int64

In [124]:
x_test.isnull().sum()

Age                    0
Employment Type        0
GraduateOrNot          0
AnnualIncome           3
FamilyMembers          0
ChronicDiseases        0
FrequentFlyer          0
EverTravelledAbroad    0
dtype: int64

In [125]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1490 entries, 0 to 1489
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   1490 non-null   int64
 1   Age                  1490 non-null   int64
 2   Employment Type      1490 non-null   object
 3   GraduateOrNot        1490 non-null   object
 4   AnnualIncome         1486 non-null   float64
 5   FamilyMembers        1490 non-null   int64
 6   ChronicDiseases      1490 non-null   int64
 7   FrequentFlyer        1490 non-null   object
 8   EverTravelledAbroad  1490 non-null   object
dtypes: float64(1), int64(4), object(4)
memory usage: 104.9+ KB

In [126]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 497 entries, 0 to 496
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  497 non-null    int64
 1   Employment Type      497 non-null    object
 2   GraduateOrNot        497 non-null    object
 3   AnnualIncome         494 non-null    float64
 4   FamilyMembers        497 non-null    int64
 5   ChronicDiseases      497 non-null    int64
 6   FrequentFlyer        497 non-null    object
 7   EverTravelledAbroad  497 non-null    object
dtypes: float64(1), int64(3), object(4)
memory usage: 34.9+ KB

#### y_train에 비율이 맞지 않음

In [127]:
y_train[['TravelInsurance']].value_counts()

TravelInsurance
0                  965
1                  525
dtype: int64

In [128]:
x_train_encoding = x_train[['Employment Type','GraduateOrNot','FamilyMembers','FrequentFlyer','EverTravelledAbroad']]
x_train_encoding.head()

,Employment Type,GraduateOrNot,FamilyMembers,FrequentFlyer,EverTravelledAbroad
0,Private Sector/Self Employed,Yes,6,No,No
1,Private Sector/Self Employed,Yes,7,No,No
2,Private Sector/Self Employed,Yes,7,No,No
3,Government Sector,Yes,6,No,No
4,Private Sector/Self Employed,Yes,6,No,Yes

In [129]:
x_test_encoding = x_test[['Employment Type','GraduateOrNot','FamilyMembers','FrequentFlyer','EverTravelledAbroad']]
x_test_encoding.head()

,Employment Type,GraduateOrNot,FamilyMembers,FrequentFlyer,EverTravelledAbroad
id,,,,,
0,Government Sector,Yes,5,No,No
1,Government Sector,Yes,5,No,No
2,Government Sector,Yes,2,No,No
3,Private Sector/Self Employed,Yes,6,No,Yes
4,Private Sector/Self Employed,No,3,No,No

In [130]:
temp = pd.concat([x_train_encoding, x_test_encoding], axis=0)
temp_encoding = pd.get_dummies(temp)
x_train_encoding = temp_encoding.iloc[:1490]
x_test_encoding = temp_encoding.iloc[1490:]

x_train_encoding.shape, x_test_encoding.shape

((1490, 10), (497, 10))

In [131]:
x_train.drop(columns=(['Employment Type','GraduateOrNot','FamilyMembers','FrequentFlyer','EverTravelledAbroad']),inplace=True)
x_train

         id  Age  AnnualIncome  ChronicDiseases
0     10000   28     1250000.0                1
1     10001   31     1250000.0                1
2     10002   29     1200000.0                0
3     10003   33      650000.0                1
4     10004   28      800000.0                0
...     ...  ...           ...              ...
1485  11485   28      800000.0                0
1486  11486   34     1000000.0                0
1487  11487   26      450000.0                1
1488  11488   25     1150000.0                1
1489  11489   31      400000.0                0

[1490 rows x 4 columns]

In [132]:
x_test.drop(columns=(['Employment Type','GraduateOrNot','FamilyMembers','FrequentFlyer','EverTravelledAbroad']),inplace=True)
x_test

     Age  AnnualIncome  ChronicDiseases
id
0     32      650000.0                0
1     27      500000.0                0
2     32      350000.0                0
3     26     1400000.0                0
4     27      350000.0                0
..   ...           ...              ...
492   25     1150000.0                1
493   34     1500000.0                0
494   33      700000.0                0
495   26     1400000.0                0
496   26     1500000.0                0

[497 rows x 3 columns]

In [133]:
x_train = pd.concat([x_train, x_train_encoding], axis=1)
x_train.head()

,id,Age,AnnualIncome,ChronicDiseases,FamilyMembers,Employment Type_Casual employment,Employment Type_Government Sector,Employment Type_Private Sector/Self Employed,GraduateOrNot_No,GraduateOrNot_Yes,FrequentFlyer_No,FrequentFlyer_Yes,EverTravelledAbroad_No,EverTravelledAbroad_Yes
0,10000,28,1250000.0,1,6,0,0,1,0,1,1,0,1,0
1,10001,31,1250000.0,1,7,0,0,1,0,1,1,0,1,0
2,10002,29,1200000.0,0,7,0,0,1,0,1,1,0,1,0
3,10003,33,650000.0,1,6,0,1,0,0,1,1,0,1,0
4,10004,28,800000.0,0,6,0,0,1,0,1,1,0,0,1

In [134]:
x_test = pd.concat([x_test, x_test_encoding], axis=1)
x_test.head()

,Age,AnnualIncome,ChronicDiseases,FamilyMembers,Employment Type_Casual employment,Employment Type_Government Sector,Employment Type_Private Sector/Self Employed,GraduateOrNot_No,GraduateOrNot_Yes,FrequentFlyer_No,FrequentFlyer_Yes,EverTravelledAbroad_No,EverTravelledAbroad_Yes
0,32,650000.0,0,5,0,1,0,0,1,1,0,1,0
1,27,500000.0,0,5,0,1,0,0,1,1,0,1,0
2,32,350000.0,0,2,0,1,0,0,1,1,0,1,0
3,26,1400000.0,0,6,0,0,1,0,1,1,0,0,1
4,27,350000.0,0,3,0,0,1,1,0,1,0,1,0

In [135]:
#결측치를 채워보자

In [136]:
x_train.fillna(x_train['AnnualIncome'].median(), inplace=True)

In [137]:
x_train.isnull().sum()

id                                              0
Age                                             0
AnnualIncome                                    0
ChronicDiseases                                 0
FamilyMembers                                   0
Employment Type_Casual employment               0
Employment Type_Government Sector               0
Employment Type_Private Sector/Self Employed    0
GraduateOrNot_No                                0
GraduateOrNot_Yes                               0
FrequentFlyer_No                                0
FrequentFlyer_Yes                               0
EverTravelledAbroad_No                          0
EverTravelledAbroad_Yes                         0
dtype: int64

In [138]:
x_test.fillna(x_test['AnnualIncome'].median(), inplace=True)

In [139]:
x_test.isnull().sum()

Age                                             0
AnnualIncome                                    0
ChronicDiseases                                 0
FamilyMembers                                   0
Employment Type_Casual employment               0
Employment Type_Government Sector               0
Employment Type_Private Sector/Self Employed    0
GraduateOrNot_No                                0
GraduateOrNot_Yes                               0
FrequentFlyer_No                                0
FrequentFlyer_Yes                               0
EverTravelledAbroad_No                          0
EverTravelledAbroad_Yes                         0
dtype: int64

In [144]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import cross_val_score,GridSearchCV

In [145]:
model=RandomForestClassifier()

In [146]:
result = cross_val_score(model, x_train, y_train, cv=5, scoring='roc_auc')
result.mean()

C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)

0.801327411793733

In [142]:
from xgboost import XGBClassifier
from xgboost import XGBClassifier

In [143]:
model = XGBClassifier()
result = cross_val_score(model, x_train, y_train, cv=5, scoring='roc_auc')
result.mean()

C:\Users\PC\anaconda3\lib\site-packages\xgboost\sklearn.py:888: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\PC\anaconda3\lib\site-packages\xgboost\sklearn.py:888: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

[11:19:18] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[11:19:18] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

C:\Users\PC\anaconda3\lib\site-packages\xgboost\sklearn.py:888: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\PC\anaconda3\lib\site-packages\xgboost\sklearn.py:888: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\PC\anaconda3\lib\site-packages\xgboost\sklearn.py:888: UserWarning: The use of label encoder in XGBClassifier is deprecated and will be removed in a future release. To remove this warning, do the following: 1) Pass option use_label_encoder=False when constructing XGBClassifier object; and 2) Encode your labels (y) as integers starting with 0, i.e. 0, 1, 2, ..., [num_class - 1].
  warnings.warn(label_encoder_deprecation_msg, UserWarning)

[11:19:18] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[11:19:18] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[11:19:18] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

C:\Users\PC\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

0.7873377744880334

In [45]:
model.fit(x_train, y_train)

<ipython-input-45-139fa7af76d2>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(x_train, y_train)

RandomForestClassifier()

In [46]:
pre = model.predict(x_test)
pre

array([0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0,
       0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1], dtype=int64)

In [51]:
proba = model.predict_proba(x_test)
proba

array([[0.91      , 0.09      ],
       [0.98041667, 0.01958333],
       [0.92516667, 0.07483333],
       [0.        , 1.        ],
       [0.81095238, 0.18904762],
       [0.        , 1.        ],
       [0.91      , 0.09      ],
       [0.90166667, 0.09833333],
       [0.06545238, 0.93454762],
       [0.99666667, 0.00333333],
       [0.949     , 0.051     ],
       [0.90367944, 0.09632056],
       [0.6775    , 0.3225    ],
       [0.73893651, 0.26106349],
       [0.12      , 0.88      ],
       [1.        , 0.        ],
       [0.6925    , 0.3075    ],
       [1.        , 0.        ],
       [0.65416667, 0.34583333],
       [0.74571825, 0.25428175],
       [0.76321429, 0.23678571],
       [1.        , 0.        ],
       [0.01083333, 0.98916667],
       [0.        , 1.        ],
       [0.90367944, 0.09632056],
       [0.        , 1.        ],
       [0.01      , 0.99      ],
       [0.998     , 0.002     ],
       [0.        , 1.        ],
       [0.        , 1.        ],
       [0.97083333, 0.02916667],
       [0.90321429, 0.09678571],
       [0.93333333, 0.06666667],
       [0.38666667, 0.61333333],
       [0.99      , 0.01      ],
       [0.02      , 0.98      ],
       [0.84705556, 0.15294444],
       [0.76      , 0.24      ],
       [0.        , 1.        ],
       [0.99613553, 0.00386447],
       [0.9575    , 0.0425    ],
       [1.        , 0.        ],
       [0.8605    , 0.1395    ],
       [0.84795748, 0.15204252],
       [0.08      , 0.92      ],
       [0.9925    , 0.0075    ],
       [0.        , 1.        ],
       [0.786     , 0.214     ],
       [0.65375   , 0.34625   ],
       [1.        , 0.        ],
       [0.98      , 0.02      ],
       [0.81430483, 0.18569517],
       [0.39766667, 0.60233333],
       [0.84      , 0.16      ],
       [0.96666667, 0.03333333],
       [0.998     , 0.002     ],
       [0.66545635, 0.33454365],
       [0.09      , 0.91      ],
       [0.48388095, 0.51611905],
       [0.05666667, 0.94333333],
       [0.38166667, 0.61833333],
       [0.475     , 0.525     ],
       [0.70193401, 0.29806599],
       [0.61033333, 0.38966667],
       [0.75804762, 0.24195238],
       [0.95333333, 0.04666667],
       [0.445     , 0.555     ],
       [0.1       , 0.9       ],
       [0.1       , 0.9       ],
       [0.99414286, 0.00585714],
       [0.27      , 0.73      ],
       [0.96833333, 0.03166667],
       [1.        , 0.        ],
       [0.02      , 0.98      ],
       [0.81      , 0.19      ],
       [1.        , 0.        ],
       [0.99333333, 0.00666667],
       [0.03      , 0.97      ],
       [0.        , 1.        ],
       [1.        , 0.        ],
       [0.89367455, 0.10632545],
       [0.03      , 0.97      ],
       [0.985     , 0.015     ],
       [0.98383333, 0.01616667],
       [0.89416667, 0.10583333],
       [0.83080952, 0.16919048],
       [0.99613553, 0.00386447],
       [0.95169048, 0.04830952],
       [0.        , 1.        ],
       [0.93067857, 0.06932143],
       [0.99875   , 0.00125   ],
       [0.81      , 0.19      ],
       [0.53      , 0.47      ],
       [0.67833333, 0.32166667],
       [0.        , 1.        ],
       [0.28516667, 0.71483333],
       [0.        , 1.        ],
       [1.        , 0.        ],
       [0.85416667, 0.14583333],
       [0.969     , 0.031     ],
       [0.61536508, 0.38463492],
       [0.96036905, 0.03963095],
       [0.        , 1.        ],
       [0.77916667, 0.22083333],
       [0.975     , 0.025     ],
       [0.93603968, 0.06396032],
       [0.49513095, 0.50486905],
       [0.        , 1.        ],
       [0.        , 1.        ],
       [0.4       , 0.6       ],
       [0.805     , 0.195     ],
       [0.91568773, 0.08431227],
       [0.98666667, 0.01333333],
       [0.09      , 0.91      ],
       [0.        , 1.        ],
       [0.97016667, 0.02983333],
       [0.99166667, 0.00833333],
       [0.77666667, 0.22333333],
       [0.27      , 0.73      ],
       [0.58      , 0.42      ],
       [0.5217381 , 0.4782619 ],
       [0.34666667, 0.65333333],
       [0.965     , 0.035     ],
       [1.        , 0.        ],
       [0.94933333, 0.05066667],
       [0.        , 1.        ],
       [0.81208805, 0.18791195],
       [0.81612626, 0.18387374],
       [1.        , 0.        ],
       [0.97      , 0.03      ],
       [0.95208333, 0.04791667],
       [0.49883333, 0.50116667],
       [1.        , 0.        ],
       [0.93916667, 0.06083333],
       [0.7075    , 0.2925    ],
       [0.73893651, 0.26106349],
       [0.96833333, 0.03166667],
       [0.94683333, 0.05316667],
       [0.89      , 0.11      ],
       [0.        , 1.        ],
       [0.99613553, 0.00386447],
       [0.975     , 0.025     ],
       [0.02      , 0.98      ],
       [0.32733333, 0.67266667],
       [0.995     , 0.005     ],
       [0.98      , 0.02      ],
       [0.34      , 0.66      ],
       [0.95      , 0.05      ],
       [0.86      , 0.14      ],
       [0.99633333, 0.00366667],
       [1.        , 0.        ],
       [0.97358333, 0.02641667],
       [0.279     , 0.721     ],
       [0.02      , 0.98      ],
       [0.4675    , 0.5325    ],
       [0.81666667, 0.18333333],
       [0.11      , 0.89      ],
       [0.02      , 0.98      ],
       [0.        , 1.        ],
       [0.90143939, 0.09856061],
       [1.        , 0.        ],
       [1.        , 0.        ],
       [0.        , 1.        ],
       [0.99166667, 0.00833333],
       [1.        , 0.        ],
       [0.7175    , 0.2825    ],
       [0.526     , 0.474     ],
       [0.99666667, 0.00333333],
       [0.95      , 0.05      ],
       [0.95833333, 0.04166667],
       [0.98      , 0.02      ],
       [0.        , 1.        ],
       [0.992     , 0.008     ],
       [0.50321825, 0.49678175],
       [0.64      , 0.36      ],
       [1.        , 0.        ],
       [0.61164286, 0.38835714],
       [0.995     , 0.005     ],
       [0.81238095, 0.18761905],
       [0.998     , 0.002     ],
       [0.85683333, 0.14316667],
       [0.26300794, 0.73699206],
       [0.3105    , 0.6895    ],
       [1.        , 0.        ],
       [0.89367455, 0.10632545],
       [0.74571825, 0.25428175],
       [0.9975    , 0.0025    ],
       [0.19      , 0.81      ],
       [0.3       , 0.7       ],
       [0.92333333, 0.07666667],
       [0.858     , 0.142     ],
       [0.07      , 0.93      ],
       [0.9925    , 0.0075    ],
       [0.02      , 0.98      ],
       [0.70193401, 0.29806599],
       [0.36657143, 0.63342857],
       [0.831     , 0.169     ],
       [1.        , 0.        ],
       [0.        , 1.        ],
       [0.9602381 , 0.0397619 ],
       [0.88166667, 0.11833333],
       [0.42633333, 0.57366667],
       [0.988     , 0.012     ],
       [0.67833333, 0.32166667],
       [0.73499603, 0.26500397],
       [0.97583333, 0.02416667],
       [1.        , 0.        ],
       [0.73893651, 0.26106349],
       [0.956     , 0.044     ],
       [0.98      , 0.02      ],
       [0.79866667, 0.20133333],
       [0.71173413, 0.28826587],
       [0.85166667, 0.14833333],
       [0.99666667, 0.00333333],
       [0.01      , 0.99      ],
       [0.97666667, 0.02333333],
       [1.        , 0.        ],
       [0.56133333, 0.43866667],
       [0.97      , 0.03      ],
       [0.705     , 0.295     ],
       [0.05      , 0.95      ],
       [0.43441667, 0.56558333],
       [0.49883333, 0.50116667],
       [0.684     , 0.316     ],
       [0.82      , 0.18      ],
       [0.79      , 0.21      ],
       [0.63935967, 0.36064033],
       [0.67666667, 0.32333333],
       [0.95753355, 0.04246645],
       [0.8575    , 0.1425    ],
       [0.93482143, 0.06517857],
       [0.83135714, 0.16864286],
       [1.        , 0.        ],
       [0.54833333, 0.45166667],
       [0.9875    , 0.0125    ],
       [1.        , 0.        ],
       [1.        , 0.        ],
       [0.42633333, 0.57366667],
       [0.9935    , 0.0065    ],
       [0.08      , 0.92      ],
       [0.7065    , 0.2935    ],
       [0.        , 1.        ],
       [0.11      , 0.89      ],
       [0.94      , 0.06      ],
       [0.03      , 0.97      ],
       [0.73      , 0.27      ],
       [0.74396825, 0.25603175],
       [0.91      , 0.09      ],
       [1.        , 0.        ],
       [0.48321429, 0.51678571],
       [0.937     , 0.063     ],
       [0.85416667, 0.14583333],
       [0.99      , 0.01      ],
       [0.77083333, 0.22916667],
       [0.95      , 0.05      ],
       [0.25      , 0.75      ],
       [0.88933333, 0.11066667],
       [0.04      , 0.96      ],
       [0.1725    , 0.8275    ],
       [0.09      , 0.91      ],
       [0.96      , 0.04      ],
       [0.70259524, 0.29740476],
       [0.99      , 0.01      ],
       [0.85666667, 0.14333333],
       [0.95208333, 0.04791667],
       [0.57814286, 0.42185714],
       [1.        , 0.        ],
       [0.85416667, 0.14583333],
       [0.831     , 0.169     ],
       [0.57814286, 0.42185714],
       [0.87333333, 0.12666667],
       [0.27      , 0.73      ],
       [0.02      , 0.98      ],
       [0.76666667, 0.23333333],
       [0.4965    , 0.5035    ],
       [0.22102381, 0.77897619],
       [0.985     , 0.015     ],
       [0.01      , 0.99      ],
       [0.42171429, 0.57828571],
       [0.85333333, 0.14666667],
       [0.90666667, 0.09333333],
       [0.57239286, 0.42760714],
       [0.05      , 0.95      ],
       [0.25      , 0.75      ],
       [0.95208333, 0.04791667],
       [0.01      , 0.99      ],
       [0.72      , 0.28      ],
       [0.88711111, 0.11288889],
       [0.78921429, 0.21078571],
       [0.418     , 0.582     ],
       [0.965     , 0.035     ],
       [0.928     , 0.072     ],
       [1.        , 0.        ],
       [0.74845563, 0.25154437],
       [1.        , 0.        ],
       [1.        , 0.        ],
       [0.88416667, 0.11583333],
       [0.99875   , 0.00125   ],
       [0.89066667, 0.10933333],
       [0.974     , 0.026     ],
       [0.76      , 0.24      ],
       [0.89367455, 0.10632545],
       [0.99333333, 0.00666667],
       [0.81664141, 0.18335859],
       [0.74328571, 0.25671429],
       [0.87      , 0.13      ],
       [0.737     , 0.263     ],
       [0.81664141, 0.18335859],
       [1.        , 0.        ],
       [0.06      , 0.94      ],
       [0.85496429, 0.14503571],
       [0.06      , 0.94      ],
       [0.99666667, 0.00333333],
       [0.74571825, 0.25428175],
       [0.23083333, 0.76916667],
       [0.87016667, 0.12983333],
       [0.6       , 0.4       ],
       [0.78883333, 0.21116667],
       [0.81612626, 0.18387374],
       [0.93067857, 0.06932143],
       [0.9775    , 0.0225    ],
       [0.95      , 0.05      ],
       [0.05      , 0.95      ],
       [0.935     , 0.065     ],
       [0.9575    , 0.0425    ],
       [0.9925    , 0.0075    ],
       [0.82583333, 0.17416667],
       [0.73499603, 0.26500397],
       [1.        , 0.        ],
       [0.092     , 0.908     ],
       [0.34      , 0.66      ],
       [1.        , 0.        ],
       [0.99666667, 0.00333333],
       [0.9025    , 0.0975    ],
       [0.2702619 , 0.7297381 ],
       [1.        , 0.        ],
       [0.38      , 0.62      ],
       [0.9925    , 0.0075    ],
       [0.96666667, 0.03333333],
       [0.83383333, 0.16616667],
       [0.62583333, 0.37416667],
       [0.85166667, 0.14833333],
       [0.7065    , 0.2935    ],
       [0.58      , 0.42      ],
       [0.484     , 0.516     ],
       [0.34666667, 0.65333333],
       [0.97333333, 0.02666667],
       [0.885     , 0.115     ],
       [0.64708333, 0.35291667],
       [0.48555952, 0.51444048],
       [0.        , 1.        ],
       [0.68366667, 0.31633333],
       [0.573     , 0.427     ],
       [0.02      , 0.98      ],
       [0.12      , 0.88      ],
       [0.675     , 0.325     ],
       [0.        , 1.        ],
       [0.255     , 0.745     ],
       [0.75833333, 0.24166667],
       [0.41246429, 0.58753571],
       [0.91      , 0.09      ],
       [0.07      , 0.93      ],
       [0.8042684 , 0.1957316 ],
       [0.3055    , 0.6945    ],
       [0.67133333, 0.32866667],
       [0.5217381 , 0.4782619 ],
       [0.99666667, 0.00333333],
       [0.1375    , 0.8625    ],
       [1.        , 0.        ],
       [0.04      , 0.96      ],
       [0.71125   , 0.28875   ],
       [0.937     , 0.063     ],
       [0.49904762, 0.50095238],
       [0.7575    , 0.2425    ],
       [0.75833333, 0.24166667],
       [0.663     , 0.337     ],
       [0.62204762, 0.37795238],
       [0.9       , 0.1       ],
       [0.58      , 0.42      ],
       [0.26300794, 0.73699206],
       [0.3       , 0.7       ],
       [0.12      , 0.88      ],
       [0.86075758, 0.13924242],
       [1.        , 0.        ],
       [0.3125    , 0.6875    ],
       [0.75804762, 0.24195238],
       [0.91      , 0.09      ],
       [0.92      , 0.08      ],
       [0.61866667, 0.38133333],
       [0.8       , 0.2       ],
       [0.95666667, 0.04333333],
       [0.69      , 0.31      ],
       [0.81238095, 0.18761905],
       [0.94      , 0.06      ],
       [0.73499603, 0.26500397],
       [0.82083333, 0.17916667],
       [0.87333333, 0.12666667],
       [0.91047619, 0.08952381],
       [0.61536508, 0.38463492],
       [0.01083333, 0.98916667],
       [0.75821429, 0.24178571],
       [0.01      , 0.99      ],
       [0.02      , 0.98      ],
       [0.6275    , 0.3725    ],
       [0.59101984, 0.40898016],
       [0.12      , 0.88      ],
       [0.96      , 0.04      ],
       [0.66545635, 0.33454365],
       [0.        , 1.        ],
       [1.        , 0.        ],
       [0.13      , 0.87      ],
       [0.        , 1.        ],
       [0.78964286, 0.21035714],
       [0.        , 1.        ],
       [0.764     , 0.236     ],
       [0.09      , 0.91      ],
       [0.93916667, 0.06083333],
       [0.9175    , 0.0825    ],
       [0.02      , 0.98      ],
       [0.04      , 0.96      ],
       [0.89702237, 0.10297763],
       [0.92172222, 0.07827778],
       [0.27842857, 0.72157143],
       [0.        , 1.        ],
       [0.75816667, 0.24183333],
       [0.7875    , 0.2125    ],
       [0.96666667, 0.03333333],
       [0.81095238, 0.18904762],
       [0.        , 1.        ],
       [1.        , 0.        ],
       [0.81238095, 0.18761905],
       [0.45233333, 0.54766667],
       [0.08      , 0.92      ],
       [0.5385    , 0.4615    ],
       [0.98      , 0.02      ],
       [0.0025    , 0.9975    ],
       [1.        , 0.        ],
       [0.        , 1.        ],
       [0.85      , 0.15      ],
       [0.98041667, 0.01958333],
       [0.9925    , 0.0075    ],
       [0.02      , 0.98      ],
       [0.9085    , 0.0915    ],
       [0.27      , 0.73      ],
       [0.615     , 0.385     ],
       [0.0275    , 0.9725    ],
       [0.98      , 0.02      ],
       [0.64628571, 0.35371429],
       [1.        , 0.        ],
       [0.28166667, 0.71833333],
       [0.13      , 0.87      ],
       [0.82083333, 0.17916667],
       [1.        , 0.        ],
       [0.6975    , 0.3025    ],
       [0.        , 1.        ],
       [0.81664141, 0.18335859],
       [0.97315476, 0.02684524],
       [0.        , 1.        ],
       [0.98      , 0.02      ],
       [0.8625    , 0.1375    ],
       [0.95      , 0.05      ],
       [0.73      , 0.27      ],
       [0.        , 1.        ],
       [0.        , 1.        ],
       [0.98      , 0.02      ],
       [0.98166667, 0.01833333],
       [0.06      , 0.94      ],
       [0.01      , 0.99      ],
       [0.28166667, 0.71833333],
       [0.4       , 0.6       ],
       [0.64      , 0.36      ],
       [0.96036905, 0.03963095],
       [0.61536508, 0.38463492],
       [0.99714286, 0.00285714],
       [0.        , 1.        ],
       [0.81      , 0.19      ],
       [0.66545635, 0.33454365],
       [0.46      , 0.54      ],
       [0.01      , 0.99      ],
       [0.805     , 0.195     ],
       [0.        , 1.        ],
       [0.74275   , 0.25725   ],
       [0.93603968, 0.06396032],
       [0.81380303, 0.18619697],
       [0.06545238, 0.93454762],
       [0.39566667, 0.60433333],
       [0.74328571, 0.25671429],
       [1.        , 0.        ],
       [0.8025    , 0.1975    ],
       [0.1265    , 0.8735    ],
       [0.53345238, 0.46654762],
       [0.99666667, 0.00333333],
       [0.95633333, 0.04366667],
       [0.04      , 0.96      ],
       [0.71      , 0.29      ],
       [0.        , 1.        ],
       [0.        , 1.        ]])

In [48]:
dic= {'id':x_test.index, 'TravelInsurance':pre}
submit = pd.DataFrame(dic)
submit.head()

   id  TravelInsurance
0   0                0
1   1                0
2   2                0
3   3                1
4   4                0

In [49]:
sample = pd.read_csv('t2-1-sample_submission.csv')
sample.head()

   id  TravelInsurance
0   0              0.5
1   1              0.5
2   2              0.5
3   3              0.5
4   4              0.5

#### 이번엔 비율을 맞춰서 풀어보기

In [52]:
y_train['TravelInsurance'].value_counts()

0    965
1    525
Name: TravelInsurance, dtype: int64

In [53]:
#새롭게 데이터 불러오기
x_train = pd.read_csv('t2-1-train.csv')
x_test = pd.read_csv('t2-1-test.csv')

In [54]:
x_train['TravelInsurance'].value_counts()

0    965
1    525
Name: TravelInsurance, dtype: int64

In [55]:
y_0 = x_train[x_train['TravelInsurance']==0]
y_0.reset_index(drop=True,inplace=True)
y_0.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,10000,28,Private Sector/Self Employed,Yes,1250000.0,6,1,No,No,0
1,10001,31,Private Sector/Self Employed,Yes,1250000.0,7,1,No,No,0
2,10005,29,Private Sector/Self Employed,Yes,1200000.0,4,0,No,No,0
3,10006,30,Private Sector/Self Employed,No,550000.0,8,0,No,No,0
4,10010,33,Government Sector,Yes,400000.0,2,0,No,No,0

In [56]:
y_1 = x_train[x_train['TravelInsurance']==1]
y_1.reset_index(drop=True,inplace=True)
y_1.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,10002,29,Private Sector/Self Employed,Yes,1200000.0,7,0,No,No,1
1,10003,33,Government Sector,Yes,650000.0,6,1,No,No,1
2,10004,28,Private Sector/Self Employed,Yes,800000.0,6,0,No,Yes,1
3,10007,26,Private Sector/Self Employed,Yes,1400000.0,9,1,No,Yes,1
4,10008,25,Private Sector/Self Employed,No,1150000.0,6,0,No,No,1

In [57]:
y_0=y_0.sample(n=525)
y_0.reset_index(drop=True,inplace=True)
y_0.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad,TravelInsurance
0,10456,34,Private Sector/Self Employed,Yes,700000.0,5,1,No,Yes,0
1,10818,26,Government Sector,Yes,500000.0,5,0,No,No,0
2,10136,27,Private Sector/Self Employed,No,450000.0,4,0,No,No,0
3,10453,28,Government Sector,Yes,300000.0,6,1,No,No,0
4,11411,26,Private Sector/Self Employed,Yes,600000.0,5,0,No,No,0

In [59]:
y_0.shape[0]

525

In [65]:
x_train = pd.concat([y_0, y_1], axis=0)
x_train.reset_index(drop=True,inplace=True)
x_train.shape[0]

1050

In [66]:
y_train = x_train[['id','TravelInsurance']]
y_train.set_index('id', inplace=True)
y_train.head()

       TravelInsurance
id
10456                0
10818                0
10136                0
10453                0
11411                0

In [67]:
x_train.set_index('id', inplace=True)

In [68]:
x_train.drop(columns=['TravelInsurance'], inplace=True)
x_train.head()

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
id,,,,,,,,
10456,34,Private Sector/Self Employed,Yes,700000.0,5,1,No,Yes
10818,26,Government Sector,Yes,500000.0,5,0,No,No
10136,27,Private Sector/Self Employed,No,450000.0,4,0,No,No
10453,28,Government Sector,Yes,300000.0,6,1,No,No
11411,26,Private Sector/Self Employed,Yes,600000.0,5,0,No,No

In [69]:
x_train.isnull().sum()

Age                    0
Employment Type        0
GraduateOrNot          0
AnnualIncome           2
FamilyMembers          0
ChronicDiseases        0
FrequentFlyer          0
EverTravelledAbroad    0
dtype: int64

In [72]:
#결측치대체해주기
x_train.fillna(x_train['AnnualIncome'].median(), inplace=True)
x_train.head()

,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
id,,,,,,,,
10456,34,Private Sector/Self Employed,Yes,700000.0,5,1,No,Yes
10818,26,Government Sector,Yes,500000.0,5,0,No,No
10136,27,Private Sector/Self Employed,No,450000.0,4,0,No,No
10453,28,Government Sector,Yes,300000.0,6,1,No,No
11411,26,Private Sector/Self Employed,Yes,600000.0,5,0,No,No

In [73]:
x_train.isnull().sum()

Age                    0
Employment Type        0
GraduateOrNot          0
AnnualIncome           0
FamilyMembers          0
ChronicDiseases        0
FrequentFlyer          0
EverTravelledAbroad    0
dtype: int64

In [74]:
#결측치대체해주기
x_test.fillna(x_test['AnnualIncome'].median(), inplace=True)
x_test.head()

,id,Age,Employment Type,GraduateOrNot,AnnualIncome,FamilyMembers,ChronicDiseases,FrequentFlyer,EverTravelledAbroad
0,0,32,Government Sector,Yes,650000.0,5,0,No,No
1,1,27,Government Sector,Yes,500000.0,5,0,No,No
2,2,32,Government Sector,Yes,350000.0,2,0,No,No
3,3,26,Private Sector/Self Employed,Yes,1400000.0,6,0,No,Yes
4,4,27,Private Sector/Self Employed,No,350000.0,3,0,No,No

In [78]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1050 entries, 10456 to 11487
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  1050 non-null   int64
 1   Employment Type      1050 non-null   object
 2   GraduateOrNot        1050 non-null   object
 3   AnnualIncome         1050 non-null   float64
 4   FamilyMembers        1050 non-null   int64
 5   ChronicDiseases      1050 non-null   int64
 6   FrequentFlyer        1050 non-null   object
 7   EverTravelledAbroad  1050 non-null   object
dtypes: float64(1), int64(3), object(4)
memory usage: 73.8+ KB

In [75]:
x_test.isnull().sum()

id                     0
Age                    0
Employment Type        0
GraduateOrNot          0
AnnualIncome           0
FamilyMembers          0
ChronicDiseases        0
FrequentFlyer          0
EverTravelledAbroad    0
dtype: int64

#### 둘의 Employment Type에 차이가 있음

In [76]:
x_train['Employment Type'].nunique()

2

In [79]:
x_train['Employment Type'].unique()

array(['Private Sector/Self Employed', 'Government Sector'], dtype=object)

In [77]:
x_test['Employment Type'].nunique()

3

In [80]:
x_test['Employment Type'].unique()

array(['Government Sector', 'Private Sector/Self Employed',
       'Casual employment'], dtype=object)

In [ ]:
x_train['Employment Type'].nunique()

In [81]:
x_train_encoding = x_train[['Employment Type','GraduateOrNot','FrequentFlyer','EverTravelledAbroad']]
x_test_encoding = x_test[['Employment Type','GraduateOrNot','FrequentFlyer','EverTravelledAbroad']]

In [83]:
x_train.drop(columns=['Employment Type','GraduateOrNot','FrequentFlyer','EverTravelledAbroad'],axis=1, inplace=True)
x_test.drop(columns=['Employment Type','GraduateOrNot','FrequentFlyer','EverTravelledAbroad'],axis=1, inplace=True)

In [84]:
x_train.head()

       Age  AnnualIncome  FamilyMembers  ChronicDiseases
id
10456   34      700000.0              5                1
10818   26      500000.0              5                0
10136   27      450000.0              4                0
10453   28      300000.0              6                1
11411   26      600000.0              5                0

In [86]:
x_train_encoding.shape

(1050, 4)

In [88]:
temp = pd.concat([x_train_encoding, x_test_encoding], axis=0)
temp_encoding = pd.get_dummies(temp)
x_train_encoding = temp_encoding.iloc[:1050]
x_test_encoding = temp_encoding.iloc[1050:]

x_train_encoding.shape, x_test_encoding.shape

((1050, 9), (497, 9))

In [89]:
x_test.set_index('id', inplace=True)

<bound method NDFrame.head of      Age  AnnualIncome  FamilyMembers  ChronicDiseases
id
0     32      650000.0              5                0
1     27      500000.0              5                0
2     32      350000.0              2                0
3     26     1400000.0              6                0
4     27      350000.0              3                0
..   ...           ...            ...              ...
492   25     1150000.0              5                1
493   34     1500000.0              9                0
494   33      700000.0              4                0
495   26     1400000.0              4                0
496   26     1500000.0              3                0

[497 rows x 4 columns]>

In [90]:
x_test.head()

    Age  AnnualIncome  FamilyMembers  ChronicDiseases
id
0    32      650000.0              5                0
1    27      500000.0              5                0
2    32      350000.0              2                0
3    26     1400000.0              6                0
4    27      350000.0              3                0

In [91]:
x_train = pd.concat([x_train, x_train_encoding],axis=1)
x_train.head()

,Age,AnnualIncome,FamilyMembers,ChronicDiseases,Employment Type_Casual employment,Employment Type_Government Sector,Employment Type_Private Sector/Self Employed,GraduateOrNot_No,GraduateOrNot_Yes,FrequentFlyer_No,FrequentFlyer_Yes,EverTravelledAbroad_No,EverTravelledAbroad_Yes
10456,34,700000.0,5,1,0,0,1,0,1,1,0,0,1
10818,26,500000.0,5,0,0,1,0,0,1,1,0,1,0
10136,27,450000.0,4,0,0,0,1,1,0,1,0,1,0
10453,28,300000.0,6,1,0,1,0,0,1,1,0,1,0
11411,26,600000.0,5,0,0,0,1,0,1,1,0,1,0

In [92]:
x_test = pd.concat([x_test, x_test_encoding],axis=1)
x_test.head()

,Age,AnnualIncome,FamilyMembers,ChronicDiseases,Employment Type_Casual employment,Employment Type_Government Sector,Employment Type_Private Sector/Self Employed,GraduateOrNot_No,GraduateOrNot_Yes,FrequentFlyer_No,FrequentFlyer_Yes,EverTravelledAbroad_No,EverTravelledAbroad_Yes
0,32,650000.0,5,0,0,1,0,0,1,1,0,1,0
1,27,500000.0,5,0,0,1,0,0,1,1,0,1,0
2,32,350000.0,2,0,0,1,0,0,1,1,0,1,0
3,26,1400000.0,6,0,0,0,1,0,1,1,0,0,1
4,27,350000.0,3,0,0,0,1,1,0,1,0,1,0

In [93]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import cross_val_score, GridSearchCV

In [95]:
y_train['TravelInsurance'].value_counts()

1    525
0    525
Name: TravelInsurance, dtype: int64

In [94]:
model = RandomForestClassifier()
result = cross_val_score(model, x_train, y_train, cv=5, scoring='roc_auc')
result.mean()

C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)

0.7721179138321996

In [96]:
result

array([0.81061224, 0.72571429, 0.80512472, 0.76113379, 0.75800454])

In [97]:
model.fit(x_train,y_train)

<ipython-input-97-4719cf73997a>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(x_train,y_train)

RandomForestClassifier()

In [98]:
pre = model.predict(x_test)

In [99]:
pre

array([0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0,
       1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0,
       1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0,
       0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1], dtype=int64)

In [100]:
dic = {'id':x_test.index, 'TravelInsurance':pre}
submit = pd.DataFrame(dic)
submit.head()

   id  TravelInsurance
0   0                0
1   1                0
2   2                0
3   3                1
4   4                0

### 회귀 문제

In [104]:
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/x_train.csv",index_col='ID')
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/y_train.csv",index_col='ID')
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/x_test.csv",index_col='ID')


display(x_train.head())
display(y_train.head())

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research
ID,,,,,,,,
0,67,327,114,3,3.0,3.0,9.02,0
1,112,321,109,4,4.0,4.0,8.68,1
2,495,301,99,3,2.5,2.0,8.45,1
3,356,317,106,2,2.0,3.5,8.12,0
4,250,321,111,3,3.5,4.0,8.83,1

    Chance of Admit
ID
0              0.61
1              0.69
2              0.68
3              0.73
4              0.77

In [105]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 400 entries, 0 to 498
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         400 non-null    int64
 1   GRE Score          400 non-null    int64
 2   TOEFL Score        400 non-null    int64
 3   University Rating  400 non-null    int64
 4   SOP                400 non-null    float64
 5   LOR                400 non-null    float64
 6   CGPA               400 non-null    float64
 7   Research           400 non-null    int64
dtypes: float64(3), int64(5)
memory usage: 28.1 KB

In [106]:
x_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 13 to 499
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         100 non-null    int64
 1   GRE Score          100 non-null    int64
 2   TOEFL Score        100 non-null    int64
 3   University Rating  100 non-null    int64
 4   SOP                100 non-null    float64
 5   LOR                100 non-null    float64
 6   CGPA               100 non-null    float64
 7   Research           100 non-null    int64
dtypes: float64(3), int64(5)
memory usage: 7.0 KB

In [108]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import cross_val_score,GridSearchCV

In [109]:
model = RandomForestRegressor()
result = cross_val_score(model, x_train, y_train, cv=5)
result.mean()

C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)
C:\Users\PC\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:593: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  estimator.fit(X_train, y_train, **fit_params)

0.8248958511236054

In [110]:
model.fit(x_train,y_train)

<ipython-input-110-4719cf73997a>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(x_train,y_train)

RandomForestRegressor()

In [111]:
pre = model.predict(x_test)
pre

array([0.6738, 0.7237, 0.8503, 0.6046, 0.6883, 0.6055, 0.937 , 0.938 ,
       0.6328, 0.5057, 0.6526, 0.7578, 0.6115, 0.9196, 0.9065, 0.7982,
       0.7905, 0.6033, 0.7081, 0.911 , 0.8013, 0.7138, 0.7399, 0.5343,
       0.6661, 0.7179, 0.7574, 0.9298, 0.6566, 0.6612, 0.7012, 0.6377,
       0.5348, 0.7777, 0.6927, 0.6725, 0.9017, 0.8994, 0.7333, 0.9198,
       0.7632, 0.6954, 0.9035, 0.6733, 0.5508, 0.4506, 0.8112, 0.7861,
       0.7743, 0.8007, 0.717 , 0.5477, 0.6672, 0.6778, 0.7874, 0.6197,
       0.7837, 0.5406, 0.8638, 0.8062, 0.8783, 0.6413, 0.5689, 0.825 ,
       0.8256, 0.9089, 0.7212, 0.7023, 0.4501, 0.6458, 0.4164, 0.7676,
       0.5474, 0.633 , 0.7182, 0.8362, 0.5859, 0.9562, 0.5997, 0.6013,
       0.8783, 0.5628, 0.6575, 0.7612, 0.8059, 0.5947, 0.5879, 0.5097,
       0.7368, 0.6763, 0.6651, 0.9305, 0.6895, 0.6366, 0.5802, 0.5836,
       0.9289, 0.6449, 0.9   , 0.5622])

In [112]:
dic = {'ID':x_test.index, 'Chance of Admit':pre}
submit=pd.DataFrame(dic)
submit

     ID  Chance of Admit
0    13           0.6738
1    16           0.7237
2    23           0.8503
3    25           0.6046
4    29           0.6883
..  ...              ...
95  467           0.5836
96  484           0.9289
97  485           0.6449
98  489           0.9000
99  499           0.5622

[100 rows x 2 columns]

### 상위 문제 확인해보기

In [179]:
import pandas as pd
train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/train.csv")
train.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

In [ ]:
#Question 흡연자와 비흡연자 각각 charges의 상위 10% 그룹의 평균의 차이는?

In [180]:
data = train[train['smoker']=='yes']
data.reset_index(drop=True, inplace=True)
data.head()

   age     sex    bmi  children smoker     region     charges
0   47  female  27.83         0    yes  southeast  23065.4207
1   18    male  31.68         2    yes  southeast  34303.1672
2   50    male  32.30         1    yes  northeast  41919.0970
3   27    male  31.13         1    yes  southeast  34806.4677
4   48    male  28.00         1    yes  southwest  23568.2720

In [183]:
data=data.sort_values(by='charges', ascending=False)
data.reset_index(drop=True, inplace=True)

In [184]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   54  female  47.410         0    yes  southeast  63770.42801
1   45    male  30.360         0    yes  southeast  62592.87309
2   52    male  34.485         3    yes  northwest  60021.39897
3   31  female  38.095         1    yes  northeast  58571.07448
4   33  female  35.530         0    yes  northwest  55135.40209

In [190]:
yes=data.iloc[:10]

In [196]:
yes2=yes['charges'].mean()

In [194]:
no=train[train['smoker']=='no'].sort_values(by='charges',ascending=False).iloc[:10]['charges'].mean()

In [195]:
no

31182.806581

In [197]:
yes2-no

23872.833257000002

In [199]:
high = train.loc[train.smoker =='yes'].charges.quantile(q=0.90)
high2 = train.loc[train.smoker =='no'].charges.quantile(q=0.90)
mean_yes = train.loc[(train.smoker =='yes') &(train.charges >=high)].charges.mean()
mean_no = train.loc[(train.smoker =='no') &(train.charges >=high2)].charges.mean()
answer = mean_yes - mean_no
print(answer)

29297.954548156158